Dlubal.RFEM5.MaterialStrainHypothesisType
Type of the material strain hypothesis

Dlubal.RFEM5.MaterialStrainHypothesisType.UnknownStrainHypothesisType
Unknown

Dlubal.RFEM5.MaterialStrainHypothesisType.NoneHypothesisType
None

Dlubal.RFEM5.MaterialStrainHypothesisType.VonMisesHypothesisType
von Mises hypothesis

Dlubal.RFEM5.MaterialStrainHypothesisType.TrescaHypothesisType
Tresca hypothesis

Dlubal.RFEM5.MaterialStrainHypothesisType.DruckerPragerHypothesisType
Drucker-Prager

Dlubal.RFEM5.MaterialStrainHypothesisType.MohrCoulombHypothesisType
Mohr-Coulomb